[
  {
    "Id": "424936",
    "ThreadId": "207638",
    "Html": "<p>Hi,</p>\r\n<p>First of all, I would like to thank the NAudio team for creating this software package. I tried working with DirectSound and many more of the Microsoft libraries and they are pretty god awful and don't offer some of the basics that NAudio offers. So thanks a lot.</p>\r\n<p>Now to my question. I am using NAudio right now for two purposes, the first is to audio files and display them in a graph. Second, playback the file. While playing the file, I am showing in the graph via a moving line, the location of the audio that is being played back. However, this approach suffers from accuracy issues as the playback thread and the graph presentation are different threads and the synchronization is problematic. And causes the playback to sound bad because of the thread thrashing.</p>\r\n<p>This has led me to believe that perhaps, it might be possible to get information for the callback function. In this fashion, I can decide to move the line every couple of calls from the call back.</p>\r\n<p>My questions are:</p>\r\n<p>* Is this possible?</p>\r\n<p>* What sort of data is received from the call back function?</p>\r\n<p>* How often is the callback function called?</p>\r\n<p>* Will doing something between the two calls of callback cause audio distortion in the playback?</p>\r\n<p>&nbsp;</p>\r\n<p>On another subject, are there some files with documentation on the software library. I am using NAudio 1.3.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for the help,</p>\r\n<p>Oded Green</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-29T07:23:27.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "424996",
    "ThreadId": "207638",
    "Html": "<p>can you share some of the code you are using to play back audio?</p>\r\n<p>How accurate does your position cursor need to be? Remember that the callback itself is not happening at the exact moment of playback, rather it is queuing up audio that will be played later.</p>\r\n<p>Mark</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-03-29T09:05:23.677-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "426490",
    "ThreadId": "207638",
    "Html": "<p>Hi Mark,</p>\r\n<p>Thanks for the prompt response.</p>\r\n<p>Regarding the code that I am using, I used tutorial one for the code. I made some minor modifications to suite my own purposes.</p>\r\n<p>I don't the position to be millisecond accurate(although that would be nice). Coarse grain accuracy is enough.</p>\r\n<p>The question I have, is there a way for me know to know what samples(their positions in the full wave) are being played? Is there away to receive such data?</p>\r\n<p>Also, I prefer not changing any of NAudio's code so that in the future when there are new updates, I will be able to change to them.</p>\r\n<p>Once again, is there any documentation on the software?</p>\r\n<p>Regards,</p>\r\n<p>Oded</p>",
    "PostedDate": "2010-04-01T07:54:33.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "426513",
    "ThreadId": "207638",
    "Html": "<p>Hi Mark,</p>\r\n<p>I would like to add the following, I am currently using a thread that sleeps for a X amount of milliseconds and then I update the graph accordingly to the sleep(because this is the only clock that I currently have). However, for long waves(40 seconds), I have noticed that there is a lag between 2-5 seconds. This is due to syncronization problems, for this reason, I would like to get the data from the playback that tells me what blocks it is playing back.</p>\r\n<p>Thanks again,</p>\r\n<p>Oded</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-01T08:28:25.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "427931",
    "ThreadId": "207638",
    "Html": "<p>Anyone?</p>\r\n<p>Pleaese!!! :-)</p>\r\n<p>Oded</p>",
    "PostedDate": "2010-04-06T09:35:06.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]