[
  {
    "Id": "425903",
    "ThreadId": "207907",
    "Html": "<p>Mark,</p>\r\n<p>In a couple of other posts people have been asking about using ACM codecs to play other audio formats. &nbsp;In your response to these posts you suggest that the WaveFormat structure has to be identified in order to pass data through the ACM codecs.</p>\r\n<p>Please forgive my ignorance as my knowledge of audio formats and the workings of codecs is limited but I'd assumed that the purpose of a codec was to code/decode audio/video data into a standard format. &nbsp;If I install say an OGG or FLAC codec, can I use NAudio to decompress the data and play the audio or do I have to derive specific WaveFormats etc. if so why ? &nbsp;</p>\r\n<p>How does Windows Media Player accomplish this, if I install a codec it just plays. &nbsp;I presumed the codec understands the file format.</p>\r\n<p>Any information you can provide would be appreciated.</p>\r\n<p>Thanks</p>\r\n<p>Steve</p>",
    "PostedDate": "2010-03-31T03:39:18.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425907",
    "ThreadId": "207907",
    "Html": "<p>hi Steve,</p>\r\n<p>the difficulty is selecting the appropriate codec to use. You do not pass files to ACM (that would be nice and easy). Instead you pass it two WaveFormats. One is the format you want to convert from, the other is the format you want to convert to. Also, codecs do not generally expect to be passed anything but compressed audio. i.e. the additional metadata such as album art, track information, should not be passed into the codec. This means that you have do do some work to parse the file contents yourself.</p>\r\n<p>There may be some tricks that Windows Media Player uses that I don't know about, which allow totally new file types to be passed through ACM codecs correctly.</p>\r\n<p>Mark</p>",
    "PostedDate": "2010-03-31T03:46:59.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "425920",
    "ThreadId": "207907",
    "Html": "<p>Mark,</p>\r\n<p>Reading around a few bits and pieces I think Media Player utilises DirectShow filters.</p>\r\n<p>Digging around in the source code I see that NAudio contains an OggEncoder class but reading other posts it would appear that OGG playback is not supported. &nbsp;Are there plans to support OGG playback ?</p>\r\n<p>A couple of other questions....</p>\r\n<p>Does NAudio support other Windows Media formats e.g. WMA ?</p>\r\n<p>Do you have any examples of using the DMO objects ?</p>\r\n<p>Thanks</p>\r\n<p>Steve</p>",
    "PostedDate": "2010-03-31T04:17:50.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "427765",
    "ThreadId": "207907",
    "Html": "<p>the ogg interop is very old, and I doubt works properly any more. It would be nice to add ogg support but I don't have the time for it at the moment.</p>\r\n<p>WMA support is also something I would like to offer in the future. Unfortunately, Microsoft did not make their Windows Media Format SDK at all user friendly for interop with .NET, or to work out how to perform simple tasks with it.</p>\r\n<p>The only example of using DMO objects is the ResamplerDMO example. See my blog post here:</p>\r\n<p>http://mark-dot-net.blogspot.com/2008/06/screencast-creating-wav-file-resampler.html</p>\r\n<p>Mark</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-04-06T02:32:38.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]