[
  {
    "Id": "613727",
    "ThreadId": "257868",
    "Html": "\r\n<p>Mark,</p>\r\n<p>I have a problem with large wav files (3.46G). It has only a fmt chunk and one large data chunk, that exeeds the int.maxvalue size.</p>\r\n<p>I have seen in your code that a filesize this large is supported (filesize is read in a UInt32), however the chunklength is defined&nbsp;as an int and will result in a negative value, which in turn will throw errors if trying to read this number of bytes.</p>\r\n<p>To be complete, my tests started from the fileinspector,&nbsp;and i was able to modify part of the code (starting from changeset 73450), so that fileinspector could read the&nbsp;file. However i have no idea wat the implications are to the rest of the library,\r\n because i just started to use it&nbsp;(wanted to use NAudio for opening these files and utting them in smaller pieces .... because i could not find any (small command line)&nbsp;program to do this reliable)&nbsp;</p>\r\n<p>If you want i can upload them, however iwould really apreciate you could have a look for the best solution (i do not know if mine is ok)</p>\r\n<p>Thanks,</p>\r\n<p>Johan</p>\r\n",
    "PostedDate": "2011-05-16T23:47:15.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613739",
    "ThreadId": "257868",
    "Html": "<p>hi Johan,</p>\r\n<p>I had originally kept away from using uint in NAudio as it was considered bad to do since it would mean the code was not \"CLS Compliant\". However, I think this limitation matters less now (and VB.NET users can easily work with uints if needed). Whether WAV files larger than 2GB are truly valid is a matter for some debate, but I will examine the code and see if this can be changed easily.</p>\r\n<p>I hope to add <a href=\"http://en.wikipedia.org/wiki/RF64\">RF64</a> support to NAudio in the future which would be the preferred way to store files this large, and gets around the 4GB limitation.</p>\r\n<p>Mark</p>",
    "PostedDate": "2011-05-16T23:53:55.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613746",
    "ThreadId": "257868",
    "Html": "<p>Thanks for this quick reply, lookig forward for your solution.</p>\r\n<p>btw, this file is generated by another program, and there is nothing much i can do about it's length ...</p>\r\n<p>Johan.</p>",
    "PostedDate": "2011-05-17T00:11:38.617-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]