[
  {
    "Id": "1072877",
    "ThreadId": "451227",
    "Html": "Hi,<br />\n<br />\nthere's an mp3 streaming demo which, however, shows the client side. I wonder how one would get started doing the server side.<br />\n<br />\nI have simple piece of code that plays a looping mp3 file. But, when I leave out the &quot;waveOut.Play&quot; part and instead try to fill a buffer for streaming over the network, it is done with maximum speed, not in &quot;real time&quot;. In fact, it is nothing more or less than simple decoding.<br />\n<br />\nHow could I fill a buffer just for the next 4 seconds (or so)? Other samples, like the chat sample, where of no help here, because I don't have a DataAvailable event.<br />\n<br />\nBTW, is there some class overview for NAudio? It's such a great, but rather complex, library.<br />\n",
    "PostedDate": "2013-07-25T09:49:44.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073434",
    "ThreadId": "451227",
    "Html": "the server side is an internet radio server. You could I suppose create a timer to send out a seconds worth of audio each second or something like that. But that's a bit beyond the scope of what I wanted to show in the NAudio Demo project, which is more focused on actually playing audio.\r<br />\n<br />\nIf you follow the documentation tab there's links to various articles about NAudio. It's something that I know NAudio could be better at, but it is just a spare time project, and I don't have a lot of spare time at the moment.<br />\n",
    "PostedDate": "2013-07-26T05:23:33.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073442",
    "ThreadId": "451227",
    "Html": "<strong>markheath wrote:</strong><br />\n<blockquote>\nIf you follow the documentation tab there's links to various articles about NAudio. It's something that I know NAudio could be better at, but it is just a spare time project, and I don't have a lot of spare time at the moment.<br />\n</blockquote>\nI hope, you did'nt feel it as a rant. In the meantime I followed you blog a bit about inner workings.\r<br />\n<br />\nThanks!<br />\n",
    "PostedDate": "2013-07-26T05:29:00.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1073444",
    "ThreadId": "451227",
    "Html": "sure, no problem, just trying to manage people's expectations ;). I'm actually creating some training videos for Pluralsight at the moment. The first was released yesterday - <a href=\"http://pluralsight.com/training/Courses/TableOfContents/digital-audio-fundamentals\" rel=\"nofollow\">Digital Audio Fundamentals</a>, which gives all the key background knowledge people need before trying to write an audio program, and the next will hopefully be completed later this year and will be explicitly about programming with NAudio. I know its not free, but you could take out a trial or just sign up for 1 month ($29 is pretty good value for access to their entire course library for a month).<br />\n",
    "PostedDate": "2013-07-26T05:34:35.447-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]