[
  {
    "Id": "1292384",
    "ThreadId": "561852",
    "Html": "Hi there,<br />\n<br />\nI have a strange problem replacing WaveFormatConversionStream with MediaFoundationResampler in my audio processing chain:<br />\n<br />\nBackground:<br />\nThe aim is to convert the recording audio channels of a MADI device with 48khz sampling rate to nice little G.711 alaw streams.<br />\n<br />\nso far each chain looks roughly like this:<br />\n<br />\nMyMADIHandler -&gt; MyBufferedWaveProvider  -&gt; WaveFloatTo16Provider -&gt; MyWave2Stream -&gt; WaveFormatConversionStream -&gt; MyAlawProvider -&gt; MyNetworkTransceiver<br />\n<br />\nIn order for the processing to be done, MyMADIHandler signals MyBufferedAlawProvider that new sample data is available, MyAlawProvider then reads the proper calculated number of expected bytes from the conversin stream, converts thems to alaw data and passed them to the network transceiver to be sent.<br />\n<br />\nThis works quite well (for sure not nice nor optimized, but hey....)<br />\n<br />\nIn order to reduce complexity and be ready for the future (-: I replaced the WaveFormatConversionStream with a MediaFoundationResampler. However, the resampler delivers less bytes than expected to MyBufferedALawProvide on Read()r.<br />\n<br />\nI did some debugging to see, where in the chain the problem might lay:<br />\nthe MADI device is configured to pass data in 512 samples units (thus 2048 bytes). MyAlawProvider tries to read 170 bytes (512/6 * 2,  48000/8000  16 bit PCM values to convert to 85 alaw bytes) from the MF Resampler. That one in turn tries to read 96000 bytes from the upper chain (48000 16 bit data), which in turn leads to a 192000 bytes Read request at MyBufferedWaveProvider (48000 floats). Of course only 2048 bytes are returned, down the chain, feeding 1024 bytes to the resampler. <br />\n<br />\n(the resampler polls data worth a second, it looks like. Also it polls until no data is returned)<br />\n<br />\nSo far this looks quite right. However, the resampler returns only 50 bytes to MyAlawProvider instead of 170!<br />\n<br />\nDoing the same with the WAveFormatConversinStream yields the correct amount of data.<br />\n<br />\nI removed MyWave2Stream from the chain in case this quite basic &quot;adaptor&quot; I wrote might be poorly implemented, since the MF resampler works with an IWaveProvider (in contrast to the ConversionStream), but the problem remains.<br />\n<br />\nI also noted that the ConversionStream polls on Read()only once, while the MF Resampler polls till its read returns 0 bytes<br />\n<br />\nAny ideas where I went wrong?<br />\n<br />\nTIA<br />\n<br />\nHarry<br />\n<br />\nPS: the other direction (&quot;upstream chain&quot; feeding alaw data from the network as 48khz data to the MADI device seems to work ok with the MF Resampler)<br />\n<br />\nPPS: doubling the MADI device buffer size to 1024 samples leads to 220 byte reads compared to 340 which would be correct (again, WaveFormatConversionStream works as expected)<br />\n",
    "PostedDate": "2014-08-22T03:32:16.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]